app/views/users/show.html.erb

SELECT "information".* FROM "information" WHERE "information"."user_id" = ? ORDER BY "information"."id" ASC LIMIT 1  [["user_id", 3]]
---
         <td><h4>Nazione</h4></td>
         <td><h5><%= current_user.information.country %><h5></td>