app/controllers/campaigns_controller.rb

  def create
  	@campaign = current_user.campaigns.build(campaign_params)

  	if @campaign.save
---
INSERT INTO "campaigns" ("category_id", "created_at", "description", "expiration", "image_url_content_type", "image_url_file_name", "image_url_file_size", "image_url_updated_at", "target", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update

    if @campaign.update(update_campaign_params)
---
UPDATE "campaigns" SET "title" = ?, "updated_at" = ? WHERE "campaigns"."id" = 1  [["title", "Costruiamo un casino' in Africa"], ["updated_at", Sat, 07 Dec 2013 09:18:17 UTC +00:00]]

  def index
  	@campaigns = Campaign.all.paginate(page: params[:page], per_page: 1)
---
SELECT "campaigns".* FROM "campaigns" LIMIT 1 OFFSET 0
SELECT COUNT(*) FROM "campaigns"

  def my_index
  	@campaigns = current_user.campaigns.paginate(page: params[:page], per_page: 1)
---
SELECT "campaigns".* FROM "campaigns" WHERE "campaigns"."user_id" = ? LIMIT 1 OFFSET 0  [["user_id", 3]]
SELECT COUNT(*) FROM "campaigns" WHERE "campaigns"."user_id" = ?  [["user_id", 3]]

  def destroy
    offers = @campaign.offers

    offers.each do |offer|
      info = offer.user.information
      info.add_credit(offer.donation)
    end

    @campaign.destroy
---
SELECT "offers".* FROM "offers" WHERE "offers"."campaign_id" = ?  [["campaign_id", 1]]
DELETE FROM "campaigns" WHERE "campaigns"."id" = ?  [["id", 1]]
DELETE FROM "offers" WHERE "offers"."id" = ?  [["id", 1]]

    def set_campaign
      @campaign = Campaign.find(params[:id])
---
SELECT "campaigns".* FROM "campaigns" WHERE "campaigns"."id" = ? LIMIT 1  [["id", "1"]]