app/controllers/heart_controller.rb

  def index
    @campaigns = Campaign.all
---
SELECT "campaigns".* FROM "campaigns"