app/controllers/offers_controller.rb

SELECT "campaigns".* FROM "campaigns" WHERE "campaigns"."id" = ? LIMIT 1  [["id", "1"]]
---
  def new
  	@campaign = Campaign.find(params[:id])

SELECT "campaigns".* FROM "campaigns" WHERE "campaigns"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "offers" ("campaign_id", "comment", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["campaign_id", 1], ["comment", "Ciao"], ["created_at", Fri, 06 Dec 2013 11:16:30 UTC +00:00], ["updated_at", Fri, 06 Dec 2013 11:16:30 UTC +00:00], ["user_id", 3]]
UPDATE "campaigns" SET "budget" = ?, "updated_at" = ? WHERE "campaigns"."id" = 1  [["budget", #<BigDecimal:47e4b78,'0.1E4',9(45)>], ["updated_at", Fri, 06 Dec 2013 11:16:30 UTC +00:00]]
UPDATE "offers" SET "donation" = ?, "updated_at" = ? WHERE "offers"."id" = 1  [["donation", #<BigDecimal:4759000,'0.1E4',9(45)>], ["updated_at", Fri, 06 Dec 2013 11:16:30 UTC +00:00]]
---
  def create
  	donation = params[:offer][:donation]
  	@campaign = Campaign.find(params[:id])
  	@offer = current_user.offers.build(campaign_id: @campaign.id, comment: params[:offer][:comment])

  	credit = current_user.information.credit.to_f
  	donation = donation.to_f

  	if(credit-donation >= 0)

  	  if (@campaign.budget + donation)> @campaign.target
  	  	donation = @campaign.target - @campaign.budget
  	  end

  	  @campaign.budget += donation
  	  @campaign.save