app/controllers/registration_controller.rb

SELECT 1 AS one FROM "users" WHERE "users"."email" = 'svella84@gmail.com' LIMIT 1
INSERT INTO "users" ("created_at", "email", "encrypted_password", "updated_at") VALUES (?, ?, ?, ?)
INSERT INTO "information" ("created_at", "name", "surname", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Sun, 01 Dec 2013 22:27:35 UTC +00:00], ["name", "Salvatore"], ["surname", "Vella"], ["updated_at", Sun, 01 Dec 2013 22:27:35 UTC +00:00], ["user_id", 1]]
---
  def create
    @user = User.new
    @user.email = params[:user][:email]
    @user.password = params[:user][:password]
    @user.password_confirmation =params[:user][:password_confirmation]

    @information = Information.new
    @information.name = params[:information][:name]
    @information.surname = params[:information][:surname]
    @user.valid?
    if @user.errors.blank?
      @user.save
      @information.user = @user
      @information.save