app/controllers/users_controller.rb

UPDATE "information" SET "credit" = ?, "updated_at" = ? WHERE "information"."id" = 1  [["credit", #<BigDecimal:7fadac10c618,'0.15E3',9(45)>], ["updated_at", Thu, 05 Dec 2013 15:11:07 UTC +00:00]]
---
  def update_credit
  	@info = current_user.information
    quantity = params[:information][:credit]
    new_credit = @info.credit + quantity.to_f
    if @info.check_credit(quantity)
      @info.update(credit: new_credit)